RIET/src/InformationRegisters/StagesOfTransportRequests/StagesOfTransportRequests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfTransportRequests</name>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.TransportRequestStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/AccumulationRegisters/ParcelsOfTransportRequestsWithoutShipment/ParcelsOfTransportRequestsWithoutShipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ParcelsOfTransportRequestsWithoutShipment</name>
  <resources>
    <name>NumOfParcels</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Parcel</name>
    <type>
      <types>CatalogRef.Parcels</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Enums/TransportRequestStages/TransportRequestStages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TransportRequestStages</name>
  <enumValues>
    <name>Draft</name>
  </enumValues>
  <enumValues>
    <name>Requested</name>
  </enumValues>
  <enumValues>
    <name>AcceptedBySpecialist</name>
  </enumValues>
  <enumValues>
    <name>PartiallyShipped</name>
  </enumValues>
  <enumValues>
    <name>CompletelyShipped</name>
  </enumValues>
  <enumValues>
    <name>PartiallyDelivered</name>
  </enumValues>
  <enumValues>
    <name>CompletelyDelivered</name>
  </enumValues>
</mdclass:Enum>

RIET/src/InformationRegisters/StagesOfTransportRequests/ManagerModule.bsl
Функция ПолучитьTransportRequestStage(TransportRequest) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	TransportRequestStages = Перечисления.TransportRequestStages;
	
	РеквизитыTransportRequest = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(TransportRequest, "RequestedLocalTime, Проведен, TotalNumOfParcels");
	                      	
	Если РеквизитыTransportRequest.Проведен Тогда 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("TransportRequest", TransportRequest);
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ParcelsOfTransportRequestsWithoutShipmentОстатки.NumOfParcelsОстаток) КАК NumOfParcelsОстаток
		               |ИЗ
		               |	РегистрНакопления.ParcelsOfTransportRequestsWithoutShipment.Остатки(, TransportRequest = &TransportRequest) КАК ParcelsOfTransportRequestsWithoutShipmentОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИНИМУМ(TripNonLawsonCompaniesStops.ActualDepartureLocalTime) КАК MinPickUpActualDepartureLocalTime,
		               |	МАКСИМУМ(TripNonLawsonCompaniesStops.ActualDepartureLocalTime) КАК MaxPickUpActualDepartureLocalTime
		               |ИЗ
		               |	Документ.TripNonLawsonCompanies.Stops КАК TripNonLawsonCompaniesStops
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.TripNonLawsonCompanies.Parcels КАК TripNonLawsonCompaniesParcels
		               |		ПО TripNonLawsonCompaniesStops.Ссылка = TripNonLawsonCompaniesParcels.Ссылка
		               |			И TripNonLawsonCompaniesStops.Location = TripNonLawsonCompaniesParcels.Parcel.TransportRequest.PickUpWarehouse
		               |ГДЕ
		               |	TripNonLawsonCompaniesParcels.Parcel.TransportRequest = &TransportRequest
		               |	И TripNonLawsonCompaniesParcels.Ссылка.Проведен
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИНИМУМ(TripNonLawsonCompaniesStops.ActualArrivalLocalTime) КАК MinDeliverToActualLocalTime,
		               |	МАКСИМУМ(TripNonLawsonCompaniesStops.ActualDepartureLocalTime) КАК MaxDeliverToActualLocalTime
		               |ИЗ
		               |	Документ.TripNonLawsonCompanies.Stops КАК TripNonLawsonCompaniesStops
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.TripNonLawsonCompanies.Parcels КАК TripNonLawsonCompaniesParcels
		               |		ПО TripNonLawsonCompaniesStops.Ссылка = TripNonLawsonCompaniesParcels.Ссылка
		               |			И TripNonLawsonCompaniesStops.Location = TripNonLawsonCompaniesParcels.Parcel.TransportRequest.DeliverTo
		               |ГДЕ
		               |	TripNonLawsonCompaniesParcels.Parcel.TransportRequest = &TransportRequest
		               |	И TripNonLawsonCompaniesParcels.Ссылка.Проведен";
		
		Результат = Запрос.ВыполнитьПакет();
		
		ВыборкаОстатки = Результат[0].Выбрать();
		ВыборкаОстатки.Следующий();
		
		ВыборкаPickUp = Результат[1].Выбрать();
		ВыборкаPickUp.Следующий();

		ВыборкаDeliverTo = Результат[2].Выбрать();
		ВыборкаDeliverTo.Следующий();
		
		Если ВыборкаОстатки.NumOfParcelsОстаток = 0 Тогда 
			
			// все парсели в проведенных поставках
			
			Если ЗначениеЗаполнено(ВыборкаDeliverTo.MinDeliverToActualLocalTime) Тогда 
				
				Возврат TransportRequestStages.CompletelyDelivered;
				
			иначеЕсли ЗначениеЗаполнено(ВыборкаDeliverTo.MaxDeliverToActualLocalTime) Тогда 
				
				Возврат TransportRequestStages.PartiallyDelivered;
				
			иначеЕсли ЗначениеЗаполнено(ВыборкаPickUp.MinPickUpActualDepartureLocalTime) Тогда 
				
				Возврат TransportRequestStages.CompletelyShipped;

			иначеЕсли ЗначениеЗаполнено(ВыборкаPickUp.MaxPickUpActualDepartureLocalTime) Тогда 
				
				Возврат TransportRequestStages.PartiallyShipped;
				
			Иначе 
				
				Возврат TransportRequestStages.AcceptedBySpecialist;
				
			КонецЕсли;
			
		иначе 
			
			// не все парсели в проведенных поставках
			
			Если ВыборкаОстатки.NumOfParcelsОстаток = РеквизитыTransportRequest.TotalNumOfParcels Тогда 
				
				Возврат TransportRequestStages.AcceptedBySpecialist;
				
			ИначеЕсли ЗначениеЗаполнено(ВыборкаDeliverTo.MaxDeliverToActualLocalTime) Тогда 
				
				Возврат TransportRequestStages.PartiallyDelivered;

			иначеЕсли ЗначениеЗаполнено(ВыборкаPickUp.MaxPickUpActualDepartureLocalTime) Тогда 
				
				Возврат TransportRequestStages.PartiallyShipped;
				
			иначе 
				
				Возврат TransportRequestStages.AcceptedBySpecialist;
								
			КонецЕсли;
			
		КонецЕсли;		
		
	ИначеЕсли ЗначениеЗаполнено(РеквизитыTransportRequest.RequestedLocalTime) Тогда
		
		Возврат TransportRequestStages.Requested;
		
	Иначе	
		
		Возврат TransportRequestStages.Draft;
		
	КонецЕсли;
	
КонецФункции

Функция ОпределитьStage(TransportRequest) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(TransportRequest) Тогда
		Возврат Перечисления.TransportRequestStages.Draft;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", TransportRequest);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	StagesOfTransportRequests.Stage
		|ИЗ
		|	РегистрСведений.StagesOfTransportRequests КАК StagesOfTransportRequests
		|ГДЕ
		|	StagesOfTransportRequests.TransportRequest = &Ссылка";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Stage;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
